### 학습 목표
- 데이터 분석을 위한 기술 통계량 탐색
- 실데이터 활용 기술통계량 확인

In [2]:
import pandas as pd 
#hr_info 읽어오기
c

In [3]:
hr_info.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 20 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   EID                 200 non-null    object
 1   ENAME               200 non-null    object
 2   GENDER              200 non-null    object
 3   ORG_CD              197 non-null    object
 4   POS_CD              200 non-null    object
 5   AGE                 200 non-null    int64
 6   SERVICE_YEAR        200 non-null    int64
 7   EDU_LEVEL           200 non-null    object
 8   PERFORMANCE_SCORE   200 non-null    float64
 9   SALARY              200 non-null    int64
 10  LAST_PROMO_DT       182 non-null    object
 11  TRAINING_HOURS      200 non-null    int64
 12  SKILLS              200 non-null    object
 13  ACTIVE_STATE        200 non-null    object
 14  HIRE_DATE           200 non-null    object
 15  RETIRE_DATE         49 non-null     object
 16  RETIRE_REASON       49 non-null     object
 17  REHIRE_YN           49 non-null     object
 18  NATION              200 non-null    object
 19  ROUNDING_DEDUCTION  200 non-null    object
dtypes: float64(1), int64(4), object(15)
memory usage: 31.4+ KB

In [5]:
#기술통계량 확인
hr_info.describe()
#count : 총 데이터 수 
#

,AGE,SERVICE_YEAR,PERFORMANCE_SCORE,SALARY,TRAINING_HOURS
count,200.000000,200.000000,200.000000,200.000000,200.000000
mean,31.930000,4.660000,1.919900,5987.000000,34.745000
std,7.111114,6.183492,1.748062,1182.676889,40.470971
min,22.000000,0.000000,0.000000,4500.000000,0.000000
25%,27.000000,0.000000,0.000000,5000.000000,4.000000
50%,30.000000,1.000000,1.795000,5600.000000,21.000000
75%,37.000000,8.000000,3.412500,6825.000000,56.750000
max,49.000000,25.000000,4.960000,10200.000000,240.000000

In [6]:
#'onject'의 기술통계
hr_info.describe(include=['object'])
#unique : 중복되지 않은 서로 다른 데이터의 개수
#top: 최빈값 확인 
#freq: 최빈값에 대한 개수

,EID,ENAME,GENDER,ORG_CD,POS_CD,EDU_LEVEL,LAST_PROMO_DT,SKILLS,ACTIVE_STATE,HIRE_DATE,RETIRE_DATE,RETIRE_REASON,REHIRE_YN,NATION,ROUNDING_DEDUCTION
count,200,200,200,197,200,200,182,200,200,200,49,49,49,200,200
unique,200,200,2,30,9,5,4,91,2,16,8,6,2,6,2
top,E00206,시이오,M,ORG023,P008,학사 학위,2024-03-01,Salesforce,Y,2024-03-01,2024-03-01,이직,N,KOREA,Y
freq,1,1,117,12,55,159,111,24,151,64,19,28,45,102,150

- 통계값 개별 확인 (총합, 평균, 개수, 중복값)

In [28]:
#연간 인건비
hr_info['SALARY'].sum()

1197400

In [9]:
#평균 연봉
hr_info['SALARY'].mean()

np.float64(5987.0)

In [10]:
#퇴사한 사람의 수 
hr_info['RETIRE_DATE'].count()
#

np.int64(49)

In [11]:
#남녀 성비 확인
#데이터 종류별 개수 카운트 
hr_info['GENDER'].value_counts()

GENDER
M    117
F     83
Name: count, dtype: int64

In [14]:
#남자 직원의 비율
men_cnt = hr_info['GENDER'].value_counts()['M']
#젠더 안의 M인덱스를 뽑는것이기 때문에 [] 대괄호 사용 

men_cnt/200 *100

np.float64(58.5)

In [16]:
#직원들의 국적 확인 
hr_info['NATION'].unique()

array(['KOREA', 'Japan', 'USA', 'India', 'China', 'UK'], dtype=object)

In [18]:
hr_info['SERVICE_YEAR'].max() #최대값

25

In [19]:
hr_info['SERVICE_YEAR'].min() #최소값

0

In [20]:
hr_info['SERVICE_YEAR'].median() #중앙값

1.0

In [21]:
hr_info['SERVICE_YEAR'].value_counts()

SERVICE_YEAR
0     73
1     36
2     18
8     11
9     11
7     11
14     7
12     7
13     5
18     4
20     4
19     4
11     3
6      2
24     1
25     1
22     1
5      1
Name: count, dtype: int64

In [24]:
#어떤 직원의 근속년수가 가장 많은지 확인 
hr_info['SERVICE_YEAR'].value_counts(ascending=True)
#ascending=Trune : 오름차순 정렬
#ascending=False : 내림차순

SERVICE_YEAR
25     1
24     1
22     1
5      1
6      2
11     3
18     4
19     4
20     4
13     5
12     7
14     7
8     11
7     11
9     11
2     18
1     36
0     73
Name: count, dtype: int64

In [25]:
hr_info['SERVICE_YEAR'].value_counts(ascending=False)

SERVICE_YEAR
0     73
1     36
2     18
8     11
9     11
7     11
14     7
12     7
13     5
18     4
20     4
19     4
11     3
6      2
24     1
25     1
22     1
5      1
Name: count, dtype: int64

- 교육수준에 따른 평균 연봉 확인

In [4]:
#교육수준('EDU_LEVEL')의 종류 확인 
hr_info['EDU_LEVEL'].unique()

array(['박사 학위', '학사 학위', '석사 학위', '고등학교 졸업', '전문대 학위'], dtype=object)

In [8]:
#'박사 학위'인 직원의 연봉(SALARY) 값의 평균
pdm = hr_info[hr_info['EDU_LEVEL'] == '박사 학위']
pdm

,EID,ENAME,GENDER,ORG_CD,POS_CD,AGE,SERVICE_YEAR,EDU_LEVEL,PERFORMANCE_SCORE,SALARY,LAST_PROMO_DT,TRAINING_HOURS,SKILLS,ACTIVE_STATE,HIRE_DATE,RETIRE_DATE,RETIRE_REASON,REHIRE_YN,NATION,ROUNDING_DEDUCTION
0,E00206,시이오,M,NaN,P001,49,25,박사 학위,4.50,10200,2024-03-01,240,"Marketing, Salesforce",Y,1999-03-01,NaN,NaN,NaN,KOREA,Y
1,E00181,나사장,F,NaN,P002,49,24,박사 학위,4.60,9500,2024-03-01,236,"Project Management, Marketing",Y,2000-03-01,NaN,NaN,NaN,KOREA,Y
2,E00164,난부사장,M,NaN,P003,48,22,박사 학위,4.60,9100,2024-03-01,240,"Salesforce, Data Analysis, Java",Y,2002-03-01,NaN,NaN,NaN,KOREA,Y
3,E00190,판라다,F,ORG007,P004,47,18,박사 학위,3.51,8500,2024-03-01,96,"Java, Data Analysis, Salesforce",Y,2006-03-01,NaN,NaN,NaN,KOREA,Y
4,E00209,누훈봉,M,ORG023,P004,47,19,박사 학위,3.38,8600,2023-03-01,66,"Java, Salesforce",Y,2005-03-01,NaN,NaN,NaN,KOREA,Y
10,E00294,중우방,F,ORG021,P004,48,19,박사 학위,2.56,8600,2023-03-01,12,"Python, Salesforce, Java",Y,2005-03-01,NaN,NaN,NaN,KOREA,Y
13,E00411,구류길,M,ORG004,P004,48,18,박사 학위,4.87,8500,2024-03-01,37,"Data Analysis, Java, Python",Y,2006-03-01,NaN,NaN,NaN,USA,Y
17,E00210,봉묵정,M,ORG006,P005,41,14,박사 학위,2.65,7600,2022-03-01,46,"Salesforce, Marketing, Data Analysis",Y,2010-03-01,NaN,NaN,NaN,KOREA,Y
19,E00258,처록신,M,ORG016,P005,40,13,박사 학위,1.97,7500,2023-03-01,12,"Salesforce, Data Analysis, Project Management",Y,2011-03-01,NaN,NaN,NaN,KOREA,Y
51,E00423,강회나,F,ORG007,P006,36,9,박사 학위,3.97,7100,2022-03-01,88,"Marketing, Java, Project Management",Y,2015-03-01,NaN,NaN,NaN,Japan,Y
56,E00221,황하예,M,ORG010,P006,37,8,박사 학위,4.96,7000,2023-03-01,80,"Python, Marketing, Project Management",Y,2016-03-01,NaN,NaN,NaN,KOREA,Y
105,E00480,혁노력,M,ORG025,P007,30,1,박사 학위,3.97,5800,2024-03-01,84,Project Management,N,2023-03-01,2024-03-01,이직,N,UK,Y

In [10]:
#연봉컬럼만 가져와서 평균 계산
pdm['SALARY'].mean()

np.float64(8166.666666666667)

In [13]:
# 교육수준 종류에 따른 평균 연봉 모두 확인 
for el in hr_info['EDU_LEVEL'].unique():
    pdm = hr_info[hr_info['EDU_LEVEL'] == el]
    sal_mean = pdm['SALARY'].mean()
    print(f"{el}:{round(sal_mean,2)}")

박사 학위:8166.67
학사 학위:5727.04
석사 학위:6900.0
고등학교 졸업:6140.0
전문대 학위:5050.0

- 데이터 그룹화를 이용한 통계분석
   - groupby: 카테고리별 그룹을 만들어 연산 수행

In [14]:
# 교육수준 종류에 따른 평균
hr_info[ ['EDU_LEVEL', 'SALARY'] ].groupby(by='EDU_LEVEL').mean() #데이터를 가지고 올 데이터 
#출력하고자 하는 카테고리가 기준 -> by

                SALARY
EDU_LEVEL
고등학교 졸업    6140.000000
박사 학위      8166.666667
석사 학위      6900.000000
전문대 학위     5050.000000
학사 학위      5727.044025

In [17]:
#교육수준과 성별에 따른 평균 연봉 
hr_info[ ['EDU_LEVEL', 'GENDER','SALARY'] ].groupby(by=['EDU_LEVEL','GENDER']).mean()

                       SALARY
EDU_LEVEL GENDER
고등학교 졸업   F       6200.000000
          M       6100.000000
박사 학위     F       8425.000000
          M       8037.500000
석사 학위     F       7233.333333
          M       6525.000000
전문대 학위    F       5600.000000
          M       4500.000000
학사 학위     F       5643.076923
          M       5785.106383

In [20]:
#교육수준과 성별 별로 가장 많은 연봉을 받는 사람이 궁금
hr_info[ ['EDU_LEVEL', 'GENDER','SALARY'] ].groupby(by=['EDU_LEVEL','GENDER']).agg(['max','min','median'])

                 SALARY
                    max   min  median
EDU_LEVEL GENDER
고등학교 졸업   F        8500  4500  5900.0
          M        7100  4500  6250.0
박사 학위     F        9500  7100  8550.0
          M       10200  5800  8050.0
석사 학위     F        8600  5700  7000.0
          M        7500  5100  6850.0
전문대 학위    F        5600  5600  5600.0
          M        4500  4500  4500.0
학사 학위     F        7400  4500  5600.0
          M        8500  4500  5600.0

In [22]:
hr_info.columns

Index(['EID', 'ENAME', 'GENDER', 'ORG_CD', 'POS_CD', 'AGE', 'SERVICE_YEAR',
       'EDU_LEVEL', 'PERFORMANCE_SCORE', 'SALARY', 'LAST_PROMO_DT',
       'TRAINING_HOURS', 'SKILLS', 'ACTIVE_STATE', 'HIRE_DATE', 'RETIRE_DATE',
       'RETIRE_REASON', 'REHIRE_YN', 'NATION', 'ROUNDING_DEDUCTION'],
      dtype='object')

In [26]:
#국적에 따른 평균 성과평가점수와 최대 연봉
hr_info.groupby( by='NATION' ).agg( {'PERFORMANCE_SCORE':'mean', 'SALARY':'max' } )

        PERFORMANCE_SCORE  SALARY
NATION
China            2.550000    7400
India            1.854545    8300
Japan            2.672381    8600
KOREA            1.461765   10200
UK               2.692778    7300
USA              2.329091    8500

- 데이터 상관관계 확인

In [27]:
#성과평과점수와 연봉의 상관계수 확인 
hr_info[['PERFORMANCE_SCORE', 'SALARY']].corr()

                   PERFORMANCE_SCORE    SALARY
PERFORMANCE_SCORE           1.000000  0.609152
SALARY                      0.609152  1.000000

In [28]:
hr_info.corr( numeric_only = True )

,AGE,SERVICE_YEAR,PERFORMANCE_SCORE,SALARY,TRAINING_HOURS
AGE,1.000000,0.932563,0.582203,0.961699,0.575867
SERVICE_YEAR,0.932563,1.000000,0.492801,0.970875,0.559911
PERFORMANCE_SCORE,0.582203,0.492801,1.000000,0.609152,0.551200
SALARY,0.961699,0.970875,0.609152,1.000000,0.628931
TRAINING_HOURS,0.575867,0.559911,0.551200,0.628931,1.000000